000100 IDENTIFICATION DIVISION.                                          000100
000200 PROGRAM-ID. test-create-file-b01.                                 000200
       *> This is comment line
       PROCEDURE DIVISION.
       A000-FIRST-PARA.
           DISPLAY "Hello World!".
       STOP RUN.
