       IDENTIFICATION DIVISION.
       PROGRAM-ID. UTIL.

       DATA DIVISION.
          LINKAGE SECTION.
          01 WS-STUDENT-ID PIC 9(4).
          01 WS-STUDENT-NAME PIC A(15).

       PROCEDURE DIVISION USING WS-STUDENT-ID, WS-STUDENT-NAME.
          DISPLAY 'In Called Program'.
          MOVE 1111 TO WS-STUDENT-ID.
       EXIT PROGRAM.
