       IDENTIFICATION DIVISION.
       PROGRAM-ID. LES07-SUB-B01.

       DATA DIVISION.
           WORKING-STORAGE SECTION.
           01 WS-STUDENT-NO PIC 9(4) VALUE 1000.
           01 WS-STUDENT-NAME PIC A(30) VALUE 'Phucdn'.

       PROCEDURE DIVISION.
           CALL 'les07SubB01Sub' USING WS-STUDENT-NO, WS-STUDENT-NAME.
           DISPLAY 'Student Id : ' WS-STUDENT-NO
              DISPLAY 'Student Name : ' WS-STUDENT-NAME.
       STOP RUN.
