       IDENTIFICATION DIVISION.
       PROGRAM-ID. LES06-TABLE-B01.

       DATA DIVISION.
           WORKING-STORAGE SECTION.
               01 WS-TABLE.
                   05 WS-A PIC A(10) VALUE 'TEST-PAR' OCCURS 5 TIMES.

       PROCEDURE DIVISION.
           DISPLAY "ONE-D TABLE: "WS-TABLE.
       STOP RUN.
